'use strict'
/*
  Напиши цикл, который просит, через prompt, ввести число больше 100. 
  
  Если посетитель нажал Cancel - завершить цикл.
  
  Если посетитель ввёл другое число – попросить ввести ещё раз, 
  и так далее, пока не введет число больше 100.
  
  Предполагается, что посетитель вводит только числа, 
  обрабатывать невалидный ввод вроде строк 'qwerty' не нужно.
*/
let numbers;
do {
    numbers = prompt('Введите число больше 100.');
    const number = Number(numbers);
    if (number > 100) {
        alert('Спасибо!');
        break;
    }
    else if (numbers === null) {

    }
    else alert('Попробуйте снова');
    
}
while (numbers !== null);
